In [2]:
import pandas as pd 

data = {
    'id' : [1,2,3], 
    'name' : ['Choi', 'Lee', 'Kim'], 
    'age' : [10, 20, 30], 
    'assets' : [150.4, 123.4, 88.88], 
    'job' : ['student', 'CEO', 'Dad']
}

df = pd.DataFrame(data) 
#df = pd.DataFrame(data, columns = [~~~], index = [~~~]) 

df

   id  name  age  assets      job
0   1  Choi   10  150.40  student
1   2   Lee   20  123.40      CEO
2   3   Kim   30   88.88      Dad

In [4]:
df.sum()

id                    6
name         ChoiLeeKim
age                  60
assets           362.68
job       studentCEODad
dtype: object

In [5]:
df['assets'].sum()

362.68

In [6]:
df['assets'].mean()

120.89333333333333

In [8]:
df.describe()

        id   age      assets
count  3.0   3.0    3.000000
mean   2.0  20.0  120.893333
std    1.0  10.0   30.836507
min    1.0  10.0   88.880000
25%    1.5  15.0  106.140000
50%    2.0  20.0  123.400000
75%    2.5  25.0  136.900000
max    3.0  30.0  150.400000

In [13]:
df1 = pd.read_csv('ITrelatedWorkerStatus.csv', delimiter='\t')
df1

,Code,Classification,task,Number of employees (Unit: persons),Average age,Average career,Monthly average wage,Employment premium
0,AP,Web developer,Development,24500,31,4.0,3200000,128000
1,SD,System planning and design,plan,2450,35,9.0,3420000,137000
2,SA,SW manager,management,45000,34,5.5,2800000,112000
3,SD,Web designer,Development,54500,28,2.0,2500000,75000

In [15]:
df1['Average age'].mean()

32.0

In [16]:
df1['Monthly average wage'].max()

3420000

In [26]:
df1['Average career'].idxmin()

3

In [25]:
df1.loc[df1['Number of employees (Unit: persons)'] == df1['Number of employees (Unit: persons)'].max()]

,Code,Classification,task,Number of employees (Unit: persons),Average age,Average career,Monthly average wage,Employment premium
3,SD,Web designer,Development,54500,28,2.0,2500000,75000

In [28]:
df1.loc[df1['Number of employees (Unit: persons)'].idxmax()]['Classification']

'Web designer'

In [31]:
import numpy as np
import pandas as pd 

se = pd.Series([1, np.nan, 2, np.nan, 3, np.nan, 4, np.nan, 5])
se

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
5    NaN
6    4.0
7    NaN
8    5.0
dtype: float64

In [33]:
se[se.notnull()]

0    1.0
2    2.0
4    3.0
6    4.0
8    5.0
dtype: float64

In [34]:
se.dropna()

0    1.0
2    2.0
4    3.0
6    4.0
8    5.0
dtype: float64

In [36]:
se.fillna(0)

0    1.0
1    0.0
2    2.0
3    0.0
4    3.0
5    0.0
6    4.0
7    0.0
8    5.0
dtype: float64

In [37]:
se.fillna(se.mean())

0    1.0
1    3.0
2    2.0
3    3.0
4    3.0
5    3.0
6    4.0
7    3.0
8    5.0
dtype: float64